class ApplicationRecord < ActiveRecord::Base
  self.abstract_class = true
  
  # グローバル変数
  # $AUTHORITY_GROUP = [["システム管理者", "superuser"], ["管理者", "admin"], ["オペレーター", "operator"], ["外部オペレーター", "outside_operator"]]
  $AUTHORITY_GROUP = [["管理者", "admin"], ["オペレーター", "operator"]]
  $CHOICE_CATEGORY = [["その他", "その他"], ["施工者", "施工者"], ["調査機関", "調査機関"]]
  $HOUSE_CONSTRUCTION = [["その他", "その他"], ["鉄骨造", "鉄骨造"], ["木造", "木造"], ["RC造", "RC造"], ["SRC造", "SRC造"], ["工作物", "工作物"], ["区分所有（室内）", "区分所有（室内）"]]
  $HOUSE_FLOORS = [["平家建", "平家建"], ["2階建", "2階建"], ["3階建", "3階建"], ["4階建", "4階建"], ["5階建", "5階建"],
                   ["6階建", "6階建"], ["7階建", "7階建"], ["8階建", "8階建"], ["9階建", "9階建"], ["10階建", "10階建"],
                   ["11階建", "11階建"], ["12階建", "12階建"], ["13階建", "13階建"], ["14階建", "14階建"], ["15階建", "15階建"],
                   ["16階建", "16階建"], ["17階建", "17階建"], ["18階建", "18階建"], ["19階建", "19階建"], ["20階建", "10階建"],
                   ["21階建", "21階建"], ["22階建", "22階建"], ["23階建", "23階建"], ["24階建", "24階建"], ["25階建", "25階建"],
                   ["26階建", "26階建"], ["27階建", "27階建"], ["28階建", "28階建"], ["29階建", "29階建"], ["30階建", "30階建"],
                   ["31階建", "31階建"], ["32階建", "32階建"], ["33階建", "33階建"], ["34階建", "34階建"], ["35階建", "35階建"],
                   ["36階建", "36階建"], ["37階建", "37階建"], ["38階建", "38階建"], ["39階建", "39階建"], ["40階建", "40階建"],                   
                   ["41階建", "41階建"], ["42階建", "42階建"], ["43階建", "43階建"], ["44階建", "44階建"], ["45階建", "45階建"],
                   ["46階建", "46階建"], ["47階建", "47階建"], ["48階建", "48階建"], ["49階建", "49階建"], ["50階建", "50階建"]]
  $SURVEY_OVERVIEW = [["外部", "外部"], ["内外部", "内外部"]]
  $SURVEY_TYPE = [["事前調査", "事前調査"], ["事中調査", "事中調査"], ["事後調査", "事後調査"]]
  $ROOM_NAME = [["", ""], ["玄関", "玄関"], ["エントランス", "エントランス"], ["入口", "入口"], ["踏込", "踏込"], ["ホール", "ホール"], ["居間", "居間"],
                ["リビング", "リビング"], ["廊下", "廊下"], ["洋室", "洋室"], ["洋室②", "洋室②"], ["洋室③", "洋室③"], ["洋室④", "洋室④"],
                ["洋間", "洋間"], ["板間", "板間"], ["和室", "和室"], ["和室②", "和室②"], ["和室③", "和室③"], ["和室④", "和室④"],
                ["1-2F階段室", "1-2F階段室"], ["2-3F階段室", "2-3F階段室"], ["縁側", "縁側"], ["広緑", "広緑"], ["便所", "便所"], ["洗面所", "洗面所"],
                ["脱衣所", "脱衣所"], ["浴室", "浴室"], ["勝手口", "勝手口"], ["DK", "DK"], ["台所", "台所"], ["LDK", "LDK"],
                ["物置", "物置"], ["納戸", "納戸"], ["倉庫", "倉庫"], ["店舗", "店舗"], ["事務所", "事務所"], ["事務室", "事務室"],
                ["湯沸室", "湯沸室"], ["給湯室", "給湯室"], ["土間", "土間"], ["その他", "その他"]]
  $OUTSIDE_NAME = [["", ""], ["外部北面", "外部北面"], ["外部東面", "外部東面"], ["外部南面", "外部南面"], ["外部西面", "外部西面"], ["塀北", "塀北"],
                   ["塀北（内）", "塀北（内）"], ["塀東", "塀東"], ["塀東（内）", "塀東（内）"], ["塀南", "塀南"], ["塀南（内）", "塀南（内）"],
                   ["塀西", "塀西"], ["塀西（内）", "塀西（内）"], ["擁壁", "擁壁"], ["その他", "その他"]]
end