class ApplicationRecord < ActiveRecord::Base
  self.abstract_class = true
  
  # [[key1, values1], [key2, value2], ...]
  $AUTHORITY_GROUP = [["システム管理者", "superuser"], ["管理者", "admin"], ["オペレーター", "operator"], ["外部オペレーター", "outside_operator"]]
  $CHOICE_CATEGORY = [["その他", "その他"], ["施工者", "施工者"], ["調査機関", "調査機関"]]
  $HOUSE_CONSTRUCTION = [["その他", "その他"], ["鉄骨造", "鉄骨造"], ["木造", "木造"], ["RC造", "RC造"], ["SRC造", "SRC造"], ["工作物", "工作物"]]
  $HOUSE_FLOORS = [["1階建", "1階建"], ["2階建", "2階建"], ["3階建", "3階建"], ["4階建", "4階建"], ["5階建", "5階建"]]
  $SURVEY_OVERVIEW = [["概査", "概査"], ["精査", "精査"]]
  $SURVEY_TYPE = [["事前調査", "事前調査"], ["事中調査", "事中調査"], ["事後調査", "事後調査"]]
  $ROOM_NAME = [["", ""], ["玄関", "玄関"], ["エントランス", "エントランス"], ["入口", "入口"], ["踏込", "踏込"], ["ホール", "ホール"], ["居間", "居間"],
                ["リビング", "リビング"], ["廊下", "廊下"], ["洋室", "洋室"], ["洋室②", "洋室②"], ["洋室③", "洋室③"], ["洋室④", "洋室④"],
                ["洋間", "洋間"], ["板間", "板間"], ["和室", "和室"], ["和室②", "和室②"], ["和室③", "和室③"], ["和室④", "和室④"],
                ["1-2F階段室", "1-2F階段室"], ["2-3F階段室", "2-3F階段室"], ["縁側", "縁側"], ["広緑", "広緑"], ["便所", "便所"], ["洗面所", "洗面所"],
                ["脱衣所", "脱衣所"], ["浴室", "浴室"], ["勝手口", "勝手口"], ["DK", "DK"], ["台所", "台所"], ["LDK", "LDK"],
                ["物置", "物置"], ["納戸", "納戸"], ["倉庫", "倉庫"], ["店舗", "店舗"], ["事務所", "事務所"], ["事務室", "事務室"],
                ["湯沸室", "湯沸室"], ["給湯室", "給湯室"], ["土間", "土間"], ["その他", "内部（その他）"]]
  $OUTSIDE_NAME = [["", ""], ["外部北面", "外部北面"], ["外部東面", "外部東面"], ["外部南面", "外部南面"], ["外部西面", "外部西面"], ["塀北", "塀北"],
                   ["塀北（内）", "塀北（内）"], ["塀東", "塀東"], ["塀東（内）", "塀東（内）"], ["塀南", "塀南"], ["塀南（内）", "塀南（内）"],
                   ["塀西", "塀西"], ["塀西（内）", "塀西（内）"], ["擁壁", "擁壁"], ["その他", "外部（その他）"]]
end